/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pamoutaf <pamoutaf@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/12 15:48:14 by pamoutaf          #+#    #+#             */
/*   Updated: 2021/10/18 11:57:40 by pamoutaf         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int	main()
{
	int	a;
	int b;
	a = ft_printf("coucou |%c| toi |%c| ça va |%c|\n", ',', 0, '?');
	b = printf("coucou |%c| toi |%c| ça va |%c|\n", ',', 0, '?');
	printf("%i %i \n", a, b);
	
	return 0;
}
